class InitData:
    committees = [
        [1, '自治組織', 2],
        [2, '系學會委員會', 1],
        [3, '服務性委員會', 0],
        [4, '學術性委員會', 0],
        [5, '康樂性委員會', 0],
        [6, '體育性委員會', 0]
    ]

    clubs = {
        "自治組織": [
            '學生會', '學生議會', '畢業生聯合會'
        ],
        "系學會委員會": [
            '化學工程與材料工程系學會', '土木工程系學會', '機械工程系學會', 
            '模具工程系學會', '工業工程與管理系學會', '電機工程系學會', 
            '電子工程系學會', '資訊工程系學會', '會計資訊系學會', 
            '金融資訊系學會', '財政稅務系學會', '觀光管理系學會', 
            '智慧商務系學會', '企業管理系學會', '國際企業系學會', 
            '人力資源發展系學會','文化創意產業系學會'
        ],
        "服務性委員會": [
            '青青基層文化服務社', '動物保護社', 'Wi-Fi羅浮群'
        ],
        "學術性委員會": [
            '翰林書法社', '滔滔社', '福智青年社', '映画社',
            '資訊研習社', '機車研究社', 'ACGN二次元研究社'
        ],
        "康樂性委員會": [
            '管樂社', '典雅國樂社', '攝影社', '古典吉他社', 
            '動感口琴社', '康樂輔導研習社', '民謠吉他社', '韻箏社', 
            '魔術社', '戲劇社', '嘻哈文化研究社'
        ],
        "體育性委員會": [
            '登山社', '網球社', '桌球社', '爵士有氧社', '中華武術社', '水上活動社',
            '羽球社', '撞球社', '排球社', '街頭舞蹈社', '棒球社', '跑酷社', '滑板社'
        ],
    }

    jobs = [
        ['社長', '5'],
        ['副社長', '4'],
        ['總務長', '4'],
        ['美宣長', '3'],
        ['網管長', '3'],
    ]

class TestData:
    pass